---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingType.RemoveCorrectionFactor(Autodesk.Revit.DB.Electrical.CorrectionFactor)
source: html/2f2d2223-1a23-bac7-4666-68c2ef5a92d0.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingType.RemoveCorrectionFactor Method

Remove an existing correction factor from this temperature rating type in Revit MEP project.

## Syntax (C#)
```csharp
public void RemoveCorrectionFactor(
	CorrectionFactor correctionFactor
)
```

## Parameters
- **correctionFactor** (`Autodesk.Revit.DB.Electrical.CorrectionFactor`) - The correction factor to be removed.

## Returns
New constructed correction factor.